Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Реализовано более точное определение координат, с учетом того, что записи в таблице с полями могут быть сгруппированы и иметь заголовок и/или итоговую строку для группы (#9283).
en: More precise position determination was implemented taking into account that the records in the table with fields could be grouped and have a header and/or final row for the group (#9283).

source: Регрессионная ошибка исправлена (#10011).
en: Regression error was corrected (#10011).

source: Регрессионную ошибку исправили (#10308).
en: The regression error was corrected (#10308).

source: Регрессионную ошибку исправили (#9860).
en: The regression error was corrected (#9860).

source: Регрессионную ошибку исправили.
en: The regression error was corrected.

source: Регрессионную ошибку, которая появилась в версии 7.0.0, исправили (#9652).
en: The regression error occurred in version 7.0.0 was corrected (#9652).

source: Регрессионную ошибку, появившуюся в версии 7.0.2, исправили (#10178).
en: The regression error occurred in version 7.0.2 was corrected (#10178).

source: Редактирование флага возможно только для табличного порта.
en: It is possible to edit the checkbox only for the table port.

source: Резюме качества основывается на индексе качества и числе пропусков по заданному в настройке параметру «Максимально допустимый процент пропусков», в результате чего выдается одно из значений по каждому полю: «Непригодный», «Пригодный», «Предобработка».
en: The quality summary is based on the quality indicator and null count according to the indicator set in the settings - "Maximum allowable percentage of nulls". Then one of the values is specified for each field: "Unsuitable", "Suitable", "Preprocessing".

source: С переходом на новые библиотеки стали быстрее обрабатываться xml-файлы.
en: xml files are faster processed due to transition to new libraries.

source: С помощью переменных можно указать:
en: The following values can be specified using variables:

source: С целью унификации сценариев разных версий и редакций платформы в Loginom 6.5 добавлены глобальные переменные ProductVersion и ProductEdition, которые можно использовать при проектировании сценариев.
en: To provide unification of the workflows related to different platform versions and editions, global variables ProductVersion and ProductEdition that could be used for workflows design were added in Loginom 6.5.

source: С этой целью в Loginom появился специализированный визуализатор — Качество данных, который реализован в виде сводки по всем типам проблем.
en: For this purpose, the special visualizer (Data Quality) was introduced into Loginom. It was implemented in the summary form by all types of problems.

source: Сами .lgp файлы при этом не перезаписываются.
en: .lgp files are not rewritten in this case.

source: Самоорганизующаяся сеть
en: Self-Organizing Network

source: Сводка визуализатора Качество данных
en: Summary of the Data Quality Visualizer

source: Системе не удается найти указанный путь» (#6674).
en: System failed to find the specified path" (#6674).

source: Системе не удается найти указанный путь» (#7082).
en: System failed to find the specified path" (#7082).

source: Системе не удается найти указанный путь» (#8518).
en: System failed to find the specified path" (#8518).

source: Ситуацию исправили (#4214).
en: The situation was rectified (#4214).

source: Ситуацию исправили (#6340).
en: The situation was rectified (#6340).

source: Ситуацию исправили (#8017).
en: The situation was rectified (#8017).

source: Ситуацию исправили (#8775).
en: The situation was rectified (#8775).

source: Ситуацию исправили (#9076).
en: The situation was rectified (#9076).

source: Ситуацию исправили (#9226).
en: The situation was rectified (#9226).

source: Ситуацию исправили (#9227, #9680).
en: The situation was rectified (#9227, #9680).

source: Ситуацию исправили (#9468).
en: The situation was rectified (#9468).

source: Ситуацию исправили (#9595).
en: The situation was rectified (#9595).

source: Ситуацию исправили (#9603).
en: The situation was rectified (#9603).

source: Ситуацию исправили (#9661).
en: The situation was rectified (#9661).

source: Ситуацию исправили (#9748).
en: The situation was rectified (#9748).

source: Ситуацию исправили (#9758).
en: The situation was rectified (#9758).

source: Ситуацию исправили (#9777).
en: The situation was rectified (#9777).

source: Ситуацию исправили (#9779).
en: The situation was rectified (#9779).

source: Ситуацию исправили (#9898).
en: The situation was rectified (#9898).

source: Ситуацию исправили, при отсутствии соединении с сервером базы данных выполнение узла Импорт из базы данных завершается выводом сообщения о возникшей ошибке (#10049).
en: The situation was rectified. Upon database server connection loss, Import from database node execution was finished with an error message (#10049).

source: Ситуацию исправили.
en: The situation was rectified.

source: Скачать версию
en: Try version

source: Скорость чтения lgd-файлов увеличилась до 10 раз по сравнению с текстовыми файлами и до двух раз по сравнению с lgd-файлами версии 6.4.
en: The lgd files read speed was increased by 10 times as compared with the text files and by two times as compared with lgd files 6.4.

source: Скорректирован размер выпадающего списка у кнопки "Добавить", чтобы название порта "Дерево данных" полностью отображалось на экране (#8084, #8085).
en: The drop-down list size near "Add" button was corrected to display "Data tree" port name fully on the screen (#8084, #8085).

source: Следует учитывать, что один run-time, находящийся в пуле, занимает ~3 Мб памяти, максимальный размер пула определяется как количество ядер процессора умноженное на 2.
en: It is required to take into account that one run-time that is in the pool takes ~3 MB of the memory, maximum pool size is defined as the number of processor cores multiplied by 2.

source: Создание, удаление, перемещение, переименование папок.
en: Create, delete, move, rename folders.

source: Сортировка дискретных начальных классов узла Конечные классы заменена на устойчивую.
en: Sorting of the discrete fine classes of the Coarse Classes node was replaced with the stable one.

source: Список разрешенных для использования ODBC-драйверов: Simba Hive ODBC Driver, Microsoft Hive ODBC Driver, Cloudera ODBC Driver for Apache Hive, MapR Hive ODBC Connector.
en: The following ODBC drivers are allowed for use: Simba Hive ODBC Driver, Microsoft Hive ODBC Driver, Cloudera ODBC Driver for Apache Hive, MapR Hive ODBC Connector.

source: Список рассчитываемых при этом показателей: Экстремальные значения, Нижний уровень экстремальных значений, Верхний уровень экстремальных значений, Выбросы, Нижний уровень выбросов, Верхний уровень выбросов, Медиана, Мода, Гистограмма, Уникальные, Индекс качества и Резюме качества.
en: List of the indicators calculated in this case: Extremes, Lower extremes level, Upper extremes level, Outliers, Lower outliers level, Upper outliers level, Median, Mode, Histogram, Unique, Quality indicator and Quality summary.

source: Сравнение распределения фактических долей интервалов с теми, которые были при обучении
en: Comparison of distribution of actual bin rates with the training ones

source: Сравнение строк изменится после закрытия пакета и всех зависимых от него открытых пакетов.
en: String comparison will be changed after closing the package and all opened packages dependent on it.

source: Стал учитываться и частичный формат, т.е. в строке может быть только дата или только время (#9110, #3836).
en: The partial format is also taken into account. Namely, only date or only time must be displayed in the row (#9110, #3836).

source: Стала удобнее разработка и отладка пакетов, подключаемых на странице Ссылки.
en: It became more convenient to design and debug the packages connected on the Reference page.

source: Столбец содержит целочисленные значения с именем HttpStatusCode и меткой «Код состояния HTTP».
en: The column contains integer values with HttpStatusCode name and "HTTP Status Code" caption.

source: Страница мастера настройки узла переименована с "Параметры извлечения XML" на "Параметры разбора XML" (#8493).
en: Node wizard page was renamed from "XML extraction parameters" to "XML parsing parameters" (#8493).

source: Структуру выходных полей можно задавать непосредственно из кода
en: It is possible to set the output fields structure directly from the code.

source: Существенно расширены возможности использования компонента JavaScript, а также исправлено несколько ошибок, которые могли возникать ранее.
en: Opportunities of the JavaScript component use were significantly expanded, and several errors that could previously occur were corrected.

source: Сценарии, подготовленные в более ранних версиях, могут завершаться с ошибкой на узлах JavaScript и Python, которые были не рассчитаны на активацию в неактивной ветви Условия.
en: The workflows prepared in the earlier versions can be finished with an error on JavaScript and Python nodes that were not designed for activation in the inactive Condition branch.

source: Сценарии, созданные в предыдущих версиях Loginom, в которых используются узлы Замена и таблицы замен с дубликатами, в Loginom 7.0.1 завершатся сообщением об ошибке "Значение дублируется в таблице замен".
en: The workflows created in the previous Loginom versions in which Replace nodes and replacement tables with duplicates are used, are terminated with the following error message in Loginom 7.0.1: "The value is duplicated in the replacement table".

source: Сценарий содержит ... заблокированных узлов», а запущенные процессы продолжали выполняться и не освобождалась оперативная память.
en: Workflow contains ... locked nodes", and the running processes were still being executed, and the memory was not unallocated.

source: Т.е. заголовки, которые реально отправлялись в запросе не попадали в файл, а вместо них записывались автоматически сгенерированные.
en: Namely, the headers that were really sent in the request were not included into the file, and automatically generated headers were recorded instead of them.

source: Так как в новой версии серьезно переработан механизм переиспользования компонентов, то пакеты, в которых содержатся узлы с областью видимости «открытый» или «опубликованный», потребуют дополнительной конвертации.
en: As the components reuse mechanism has been significantly modified in the new version, additional conversion will be required for the packages that include the nodes with the "public" or "published" visibility.

source: Так как конвертация может занимать продолжительное время, рекомендуется последовательно сконвертировать все используемые пакты и сохранить их после выполненной конвертации, предварительно удалив производные компоненты, которые не планируется использовать, если это необходимо.
en: As the conversion process can take much time, it is recommended to perform the successive conversion of all used packages and save them after the executed conversion. Beforehand it is required to delete the derived components that are not planned to be used where relevant.

source: Такая проблема могла наблюдаться и в других визуализаторах с детализацией.
en: Such problem could occur also in other visualizers with detailing.

source: Такая ситуация могла возникнуть, если было отключено отображение итогов в колонках (#8639).
en: Such a situation could arise if column totals display was disabled (#8639).

source: Такая ситуация могла возникнуть, например, если в узле Квантование поданы данные на второй входной порт, в мастере настройки для любого входного поля установлена связь с назначением, далее поля или назначения отфильтрованы так, что связанное поле не попало под условие фильтрации (скрылось).
en: Such a situation could arise, for example, if data was supplied to the second input port in the Binning node, connection was set with the usage type in the wizard for any input field, then the fields or usage types were filtered in such a way that the connected field didn't fall under the filtering criterion (it was hidden).

source: Такая ситуация могла, например, возникнуть, если пользователю предоставлял доступ другой пользователь, были изменены права доступа к каталогам через панель Администрирование, или новый каталог был создан через диалог сохранения файла (#5347, #6032, #6423, #8022).
en: For example, such a situation could arise if another user gave access to the user, the rights of access to the directories via the Administration bar were changed, or the new directory was created via the file saving dialog (#5347, #6032, #6423, #8022).

source: Такая ситуация наиболее вероятна для производных компонентов, созданных по опубликованным узлам, так как чаще всего такие узлы используются для работы через Loginom Integrator или для Пакетного выполнения.
en: Such situation is most probable for the derived components created by the published nodes as these nodes are most frequently used for the work based on Loginom Integrator or for the Batch processing.

source: Такая ситуация не является циклической зависимостью, так как при «Выполнении узла», в отличии от «Узла-ссылки», используется только конфигурация узла, а данные на вход могут подаваться отличные от тех, которые используются в базовом узле (#8614).
en: Such situation does not represent a circular reference as only node configuration is used for "Node Execution" as opposed to "Reference Node", and data that differ from the data that is used in the base node can be supplied to the input (#8614).

source: Также автоматически создаются производные компоненты по всем узлам с модификатором доступа «Открытый» или «Опубликованный», так как на эти узлы могут быть ссылки в других пакетах.
en: The derived components for all nodes with the "Public" or "Published" visibility are automatically created in the same way as references to these nodes can be available in other packages.

source: Также быстрее стали загружаться пакеты, содержащие большое количество производных компонентов.
en: The packages that contain many derived components began to load also faster.

source: Также в этом разделе можно принудительно остановить выполнение сценария или сбросить сессию пользователя.
en: It is also possible to stop the workflow execution forcedly or to reset the user session in this section.

source: Также добавлены команды контекстного меню:
en: The context menu commands were also added:

source: Также есть несколько особенностей, касающихся безопасности.
en: There are also several safety issues.

source: Также можно открыть в новой вкладке пакет при нажатии с «Ctrl» («Cmd» для MacOS) на кнопки «Создать пакет», «Создать черновик», «Открыть пакет».
en: It is also possible to open the package in the new tab when pressing on "Create package", "Create draft", "Open package" buttons with "Ctrl" ("Cmd" for MacOS).

source: Также не удалялся пул приложений, если его имя не "LGI_POOL".
en: Also the application pool was not deleted unless its name was "LGI_POOL".

source: Также пропадали переводы строк у многострочной метки узла.
en: Also translations of rows disappeared at the multiline caption of the node.

source: Также цветом отображается статус опубликованных веб-сервисов: зеленым, если веб-сервис соответствует сохраненному пакету; оранжевым, если веб-сервис не соответствует сохраненному пакету; и серым, если нет доступа к опубликованному пакету.
en: Status of the published web services is also highlighted: the green color means that the web service complies with the saved package; the orange color means that the web service does not comply with the saved package; the grey color means thet there is no access to the published package.

source: Также это могло приводить к возникновении ошибок «Переход запрещен Невозможно использовать начальные классы в качестве разбиения для столбца ... Слишком много уникальных значений» или «Значение 0 параметра "Index" вне диапазона [-1; -1]» при переходе между страницами мастера настройки (#8282, #8582, #8584, #8668, #8700).
en: It could also cause the following errors: "Next move forbidden Failed to apply fine classes for binning for %s column. There are too many unique values" or "Value 0 of "Index" parameter is out of [-1; -1] range" when switching the wizard pages (#8282, #8582, #8584, #8668, #8700).

source: Такие изменения теперь не приводят к ошибке «XSD-схема на входе не соответствует настройкам обработчика» при активации узлов.
en: Now such changes do not cause "Input XSD schema does not comply with the node settings" error when activating nodes.

source: Такие методы могли требоваться для работы с некоторыми веб-сервисами.
en: Such methods could be required for operation of some web services.

source: Такое поведение может потребоваться, если структура данных заранее не известна и формируется в процессе выполнения узла.
en: Such behaviour could be required if the data structure is not known in advance and it is generated in the node execution process.

source: Такое поведение наблюдалось в очень редких случаях при быстром перетаскивании новых узлов в область построения сценария.
en: Such behavior was observed in very rare cases when quickly dragging new nodes to the workflow construction area.

source: Такой подход упрощает введение пустой строки в качестве значения замены.
en: Such approach simplifies inclusion of an empty string as the replacement value.

source: Такую ошибку можно было получить, например, если активировать, деактивировать и снова активировать Цикл с групповой обработкой по уникальным значениям полей строкового типа, настроенный на Подмодель с Нейросетью с режимом активации "всегда переобучать" (#9630).
en: Such error occurred when activating, deactivating and then activating once again Loop with the group processing by unique values of the string fields configured to Supernode with Neural network with "always retrain" activation mode (#9630).

source: Текущее окружение рабочего стола определяется значением переменной окружения XDG_CURRENT_DESKTOP.
en: The current desktop environment is defined by the value of the variable of XDG_CURRENT_DESKTOP environment.

source: Теперь Loginom Integrator может быть установлен на новый сайт, который создаётся в процессе установки приложения (#9938).
en: Now Loginom Integrator can be installed on the new site that is created while installing the application (#9938).

source: Теперь в Loginom можно выполнить весь цикл ETL операций, связанных с Хранилищами данных.
en: Now Loginom enables to perform the whole cycle of the ETL operations connected with the Data Warehouses.

source: Теперь в случае принудительного закрытия пакета через главное меню выполняется попытка завершить все текущие процессы, если в течение пяти секунд не удалось остановить все запущенные процессы, то пользователь получит сообщение о невозможности закрыть пакет (#5157, #7216).
en: Now, if the package is forcibly closed using the root menu, all current processes are attempted to be finished. If closure of all running processes is failed within five seconds, a user will receive the package closure failure message (#5157, #7216).

source: Теперь в случае, если на странице подключений выбраны только активные подключения, то кнопка «Тестировать» будет неактивна.
en: Now, if only active connections are selected on the connections page, "Test" button will be inactive.

source: Теперь в сообщении указано количество узлов в открытых пакетах, которые ссылаются на данный компонент (считаются узлы Выполнение и Цикл, а также производные узлы, созданные по данному компоненту и производным от него компонентам).
en: The number of nodes in the opened packages that refer to this component (Execution and Loop nodes, the derived nodes created by this component and the components derived from it are taken into account) is currently specified in the message.

source: Теперь в таком случае пользователю показывается одно из сообщений «Тело запроса не должно быть пустым» или «Запрос должен содержать объект json».
en: Now, one of the following messages is shown to the user in this case: "The request body must not be empty" or "Request must contain json object".

source: Теперь в узел «Переменных сценария» в порт «Переменные сессии» добавлена переменная RequestId.
en: Now RequestId variable was added to "Workflow Variables" node to "Session variables" port.

source: Теперь в этой ситуации информация о проблеме записывается в journald.
en: Now, in this case the information on this problem is recorded in journald.

source: Теперь в этом случае выводится поясняющее сообщение (#6787).
en: Now, in this case the explanatory message is displayed (#6787).

source: Теперь в этом случае пакет открывается на чтение, а пользователь получает об этом уведомление (#8431).
en: Now, in this case, it is a read-only package, and a user will receive corresponding message(#8431).

source: Теперь вместо «Узел заблокирован» выводится «Загрузка».
en: Now "Node is locked" is displayed instead of "Loading".

source: Теперь все сообщения, передаваемые 1С, дополнены описанием.
en: Now description is provided for all messages sent to 1C.

source: Теперь длина строки для быстрого просмотра ограничена 5000 символов, чтобы браузер мог отобразить данные (#5776, #6166).
en: Now the string length for the quick view is limited by 5000 characters so that the browser could display data (#5776, #6166).

source: Теперь добавлена возможность задать имя для узла модели с модификатором доступа «Открытый».
en: Now it became possible to set the name for the model node with the "Public" access modifier.

source: Теперь если Код состояния HTTP >= 400, то Код завершения будет равен 6.
en: Now, if HTTP Status Code >= 400, Error Code will be equal to 6.

source: Теперь максимально допустимая длина строкового параметра для Oracle версии 12.1 и выше - 32767 символов, в ранних версиях - 4000 символа.
en: Now, the maximum allowable length of the row parameter for Oracle 12.1 and higher is 32,767 characters, for the earlier versions - 4,000 characters.

source: Теперь можно выполнять запросы для тестирования API на странице: http://host/lgi/openapi/index.html.
en: Now it is possible to execute requests to test API on the following page: http://host/lgi/openapi/index.html.

source: Теперь можно документировать сценарий непосредственно при его проектировании, добавляя в произвольном месте блоки текста.
en: Now it became possible to document workflow directly during its designing by adding text blocks in any place.

source: Теперь настраивать Куб стало удобнее и быстрее.
en: Cube configuration process became much more comfortable and faster now.

source: Теперь отключено отображение кнопки «Автосохранение» для таких пользователей (#9043).
en: Now, "Auto save" button is not displayed for such users (#9043).

source: Теперь папка удаляется со всем содержимым без ошибок (#9100).
en: Now, the folder is deleted with its content without errors (#9100).

source: Теперь пользователь получит предупреждение до перехода на следующий шаг мастера, в случае, если в мастере настройки не выбрана таблица базы данных или не задан SQL-запрос (#6525).
en: Now, a user will receive a warning before the next wizard step if database table is not selected in the wizard, or SQL query is not set (#6525).

source: Теперь появляется предупреждение, что не выбран объект хранилища данных (#8515).
en: Now, the warning that there is no selected data warehouse object is displayed (#8515).
